<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [8]:
import pandas as pd
import numpy as np
import os

In [107]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [29]:
len(df.index)

943

2. ¿Cuál es el número de columnas en el conjunto de datos?

In [30]:
len(df.columns)

4

3. Imprime el nombre de todas las columnas

In [108]:
df.columns.tolist()

['age', 'gender', 'occupation', 'zip_code']

4. Imprima el índice del dataframe

In [120]:
df.index.to_frame()

         user_id
user_id
1              1
2              2
3              3
4              4
5              5
...          ...
939          939
940          940
941          941
942          942
943          943

[943 rows x 1 columns]

5. ¿Cuál es el tipo de datos de cada columna?

In [69]:
df.dtypes.to_frame()

                 0
age          int64
gender      object
occupation  object
zip_code    object

6. Resumir el conjunto de datos

In [45]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [54]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [121]:
df['occupation'].to_frame()

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [74]:
print(df['occupation'].unique().tolist())
len(df['occupation'].unique().tolist())

['technician', 'other', 'writer', 'executive', 'administrator', 'student', 'lawyer', 'educator', 'scientist', 'entertainment', 'programmer', 'librarian', 'homemaker', 'artist', 'engineer', 'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor']

21

10. ¿Cuál es la ocupación más frecuente?

In [100]:
df['occupation'].value_counts().idxmax()

'student'

11. ¿Cuál es la edad media de los usuarios?

In [61]:
df['age'].mean()

34.05196182396607

12. ¿Cuál es la edad con menos ocurrencia?

In [118]:
df['age'].value_counts().idxmin()

11